base/Catalogs/бит_ЗначенияПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ЗначенияПоУмолчанию</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Значения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_ЗначенияПоУмолчанию/Ext/ManagerModule.bsl
&НаСервере
Функция ПолучитьМассивЗначений(ЭлементСправочника, Объект = Неопределено, ТолькоПервое = Ложь) Экспорт
	
	Если ТипЗнч(ЭлементСправочника) = Тип("Строка") Тогда
		ЗначенияСправочника = Справочники.бит_ЗначенияПоУмолчанию[ЭлементСправочника].Значения.ВыгрузитьКолонку("Значение");	
	Иначе	
		ЗначенияСправочника = ЭлементСправочника.Значения.ВыгрузитьКолонку("Значение");
	КонецЕсли;	
		
	Если ЗначенияСправочника.Количество() <> 0 Тогда
		
		Если ТолькоПервое Тогда
			
			Возврат ЗначенияСправочника[0];
							
		Иначе
			
			Возврат ЗначенияСправочника;
			
		КонецЕсли;
		
	Иначе	
		
		Если ТолькоПервое Тогда
			ТекстСообщения = "Не установлено значение по умолчанию для элемента """ + ЭлементСправочника + """ справочника ""(бит) Значения по умолчанию""!";
			
			Если Объект <> Неопределено Тогда
				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = ТекстСообщения;
				СообщениеПользователю.КлючДанных = ЭлементСправочника; 
				СообщениеПользователю.УстановитьДанные(Объект);
				СообщениеПользователю.Сообщить();
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭлементСправочника);
			КонецЕсли;
			
			//Сообщить("Не установлено значение по умолчанию для элемента """ + ЭлементСправочника + """ справочника ""(бит) Значения по умолчанию""!");
			
			Возврат Неопределено;	
			
		Иначе	
			ТекстСообщения = "Не установлены значения по умолчанию для элемента """ + ЭлементСправочника + """ справочника ""(бит) Значения по умолчанию""!";
			Если Объект <> Неопределено Тогда
				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = ТекстСообщения;
				СообщениеПользователю.КлючДанных = ЭлементСправочника;
				СообщениеПользователю.УстановитьДанные(Объект);
				СообщениеПользователю.Сообщить();
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭлементСправочника);
			КонецЕсли;
			//Сообщить("Не установлены значения по умолчанию для элемента """ + ЭлементСправочника + """ справочника ""(бит) Значения по умолчанию""!");
			
			Возврат Новый Массив;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецФункции    

&НаСервере
Функция ЗначениеВходитВМассив(ЭлементСправочника, ИскомоеЗначение) Экспорт

	МассивЗначений = ПолучитьМассивЗначений(ЭлементСправочника, Неопределено);
		
	РезультатПоиска = МассивЗначений.Найти(ИскомоеЗначение);
	
	Возврат ?(РезультатПоиска = Неопределено, Ложь, Истина);
	
КонецФункции
